#+FILETAGS: WORKFLOW

* org-mode
** NEXT Set up level 1 headings (with properties)		   :COMPUTER:
   :PROPERTIES:
   :ID:       5196f0ca-ccb1-4fcc-b483-20f3f835838d
   :END:
** TODO Set up contexts						   :COMPUTER:
*** NEXT Create contexts
home, computer, office, anywhere, notebook, tablet, phone, errand
*** NEXT Set up context tags for headings when appropriate
e.g. for personal errands I have an errands heading which should have
the errand tag attached to it and hence any child
** TODO Setup mercurial sync and fetch				   :COMPUTER:
  CLOCK: [2012-10-18 Thu 10:59]--[2012-10-18 Thu 10:59] =>  0:00
   :PROPERTIES:
   :ID:       70331fca-6e60-44e7-9069-19e2808a45f5
   :END:
[2012-10-18 Thu 10:59]
*** NEXT research mercurial sync
** NEXT Get agenda filtering elisp functions into my org setup	   :COMPUTER:
See [[http://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=9&cad=rja&ved=0CEkQFjAI&url=http%3A%2F%2Fdoc.norang.ca%2Forg-mode.html&ei=VmGAUOnkOaTliQLw0ICICQ&usg=AFQjCNHQ1HdTsHALFTFCzKA3VWXmqPg2qA][org-mode tutorial]]
scheduled todos should not appear in the general list
  CLOCK: [2012-10-18 Thu 13:04]--[2012-10-18 Thu 13:07] =>  0:03
   :PROPERTIES:
   :ID:       83cb8720-795d-4602-829b-8b60f64a01c9
   :END:
[2012-10-18 Thu 13:04]

** NEXT Set up clocking						   :COMPUTER:
  CLOCK: [2012-10-18 Thu 13:07]--[2012-10-18 Thu 13:08] =>  0:01
   :PROPERTIES:
   :ID:       5342bba9-aa74-4548-808a-cb693e7d6f8a
   :END:
  [2012-10-18 Thu 13:07]
See [[http://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=9&cad=rja&ved=0CEkQFjAI&url=http%3A%2F%2Fdoc.norang.ca%2Forg-mode.html&ei=VmGAUOnkOaTliQLw0ICICQ&usg=AFQjCNHQ1HdTsHALFTFCzKA3VWXmqPg2qA][org-mode tutorial]]
** NEXT Set up syncing org-mode and mobile org
  CLOCK: [2012-10-21 Sun 17:26]--[2012-10-21 Sun 17:26] =>  0:00
[2012-10-21 Sun 17:26]
[[https://github.com/matburt/mobileorg-android/wiki/FAQ][syncing instructions]]
** DONE Configure tasks for later				   :COMPUTER:
   - State "DONE"       from "TODO"       [2012-10-26 Fri 15:18]
I want to be able to schedule a task for later, say after a given date
such as the 1st of the month when I get paid and not have to see it until then.
The down side is that if I filter scheduled tasks then after the day these
won't appear in general tasks but as scheduled tasks. I need some way to
mark them as hidden until later, whereupon they will appear in the general
list and not the scheduled list.
*** CANCELLED Create procedure for later scheduling of tasks 
    - State "CANCELLED"  from "NEXT"       [2012-10-26 Fri 15:17] \\
      I can just use schedule to schedule it later and it's probably a good thing
      to reminded daily that the task needs to be done.
Should be able to just schedule it for a given day and then org-mode
will keep reminding me until it's done.
*** DONE Research how to make a tickler file for org-mode
    - State "DONE"       from "TODO"       [2012-10-26 Fri 15:16]
** TODO Set up org-mode calendar				   :COMPUTER:
*** NEXT Put calendar data into org-mode
*** NEXT sync with google calendar
*** TODO Research org-mode agenda views and how to use it productively
**** NEXT Learn how to filter org-mode agenda views
I want to filter out personal tasks at work for example or show only ucsd and academic tasks
*** TODO Filter out someday tasks
** DONE Create someday todo for inactive tasks
   - State "DONE"       from "TODO"       [2012-10-29 Mon 10:40]
  CLOCK: [2012-10-26 Fri 15:06]--[2012-10-26 Fri 15:07] =>  0:01
[2012-10-26 Fri 15:06]

** TODO Make refs and working structure to reflect org structure
Also create any projects and put the under vc
  CLOCK: [2012-11-03 Sat 11:28]--[2012-11-03 Sat 11:28] =>  0:00
[2012-11-03 Sat 11:28]

** TODO Check out org-contacts
  CLOCK: [2012-11-03 Sat 19:28]--[2012-11-03 Sat 19:28] =>  0:00
[2012-11-03 Sat 19:28]
[[http://julien.danjou.info/projects/emacs-packages#org-contacts]]

** TODO Check out quantified self
  CLOCK: [2012-11-03 Sat 19:29]--[2012-11-03 Sat 19:30] =>  0:01
[2012-11-03 Sat 19:29]
[[http://lists.gnu.org/archive/html/emacs-orgmode/2012-06/msg00405.html]]
[[http://quantifiedself.com/about/]]
[[http://lists.gnu.org/archive/html/emacs-orgmode/2012-05/msg00079.html]]
[[http://sachachua.com/blog/category/quantified/]]

** TODO Generate list of uncommitted working projects for weekly review
  CLOCK: [2012-11-12 Mon 11:43]--[2012-11-12 Mon 11:44] =>  0:01
[2012-11-12 Mon 11:43]

** TODO Fix up clocking in/out on mobileorg
[2012-11-13 Tue 19:51]

* process
** TODO Develop organisation process, workflow			   :ANYWHERE:
   :PROPERTIES:
   :ID:       a96c63f6-2ee8-4042-ae7c-3f7d5bc3493e
   :END:
what are the structures?
where do things go?
e.g. active projects have next items
someday things are projects/todos without any next?
What are my 50000ft to runway goals, principles, priorities etc.
At the runway (i.e. actions) level, I should have a list of procedures for following when doing common tasks e.g. weekly review
*** NEXT Brainstorm high level planning
*** TODO Process for Learning 
If I want to learn something, e.g. some maths or self-improvement, juggling, etc., make a project for this in org-mode where I can store notes. It would be really nice to be able to put a bookmark in a pdf/ebook and create a link in org-mode to that bookmark.
**** NEXT Make org-mode checklist for process
**** NEXT Create folder for storing learning projects
  CLOCK: [2012-10-15 Mon 09:47]--[2012-10-15 Mon 09:50] =>  0:03
   :PROPERTIES:
   :ID:       f4126061-82e5-4f60-9063-ab744abea7d0
   :END:
[2012-10-15 Mon 09:47] 

*** TODO Make processes/procedures
**** NEXT Make processes org file
**** NEXT Make weekly review checklist
**** NEXT Make daily workflow checklist
**** TODO Add task
**** TODO Referee paper
**** TODO write paper
**** TODO prepare course
**** TODO Automoate getting updates from arxiv
what about journals? Do they have rss?
  CLOCK: [2012-10-19 Fri 10:04]--[2012-10-19 Fri 10:05] =>  0:01
[2012-10-19 Fri 10:04]

**** TODO Make seminar process an org-mode checklist
update website
send announcement
maintain email list of speakers, participants
If I put the schedule in an org file, I should just be able to update the
org file and have that automatically update the website and send an email
to the admin people.
*** TODO Set up reference filing
Particularly development!
  CLOCK: [2012-10-21 Sun 17:24]--[2012-10-21 Sun 17:24] =>  0:00
[2012-10-21 Sun 17:24]
** TODO Set up office like in GTD such as trays, clips etc.	     :OFFICE:
   :PROPERTIES:
   :ID:       b2f00a6f-4eb6-4129-bbe8-56f1be40359b
   :END:
*** NEXT Get trays
*** NEXT Get stationary storage
  CLOCK: [2012-10-14 Sun 19:56]--[2012-10-14 Sun 19:57] =>  0:01
   :PROPERTIES:
   :ID:       72a41c20-d196-4dbd-bb49-fd7e3e5b63d8
   :END:
[2012-10-14 Sun 19:56]
** TODO Set up home for GTD					       :HOME:
*** TODO Gather materials that need to be organised		       :HOME:
*** NEXT Get folders from office for home
** NEXT Move mygtd into refile					   :COMPUTER:
  CLOCK: [2012-10-15 Mon 22:06]--[2012-10-15 Mon 22:06] =>  0:00
   :PROPERTIES:
   :ID:       29212bbd-9706-4cfc-84ff-d28e43f0f2f8
   :END:
[2012-10-15 Mon 22:06]

** TODO Rationalise Documents, Dropbox, Ubuntu One		   :COMPUTER:
  CLOCK: [2012-10-16 Tue 09:04]--[2012-10-16 Tue 09:04] =>  0:00
   :PROPERTIES:
   :ID:       5f23f742-f0f0-4e0b-8d9d-98f5acae6a1b
   :END:
[2012-10-16 Tue 09:04]
** NEXT Process emails						   :COMPUTER:
Archive the lot! Organise into folders/tags whatever. gmail can be the main repository to sync with, but as with org files, maybe have machine specific syncing to dropbox also.
  CLOCK: [2012-10-15 Mon 09:42]--[2012-10-15 Mon 09:43] =>  0:01
   :PROPERTIES:
   :ID:       ee144a81-a3eb-43bf-879e-72e2b97b0c11
   :END:
[2012-10-15 Mon 09:42]
** TODO Create contact db					   :COMPUTER:
*** NEXT Set up BBDB with emacs
*** TODO Enter contacts into BBDB
**** People to add:
***** Bennet
***** Lei
***** Jim Isenberg
***** Scott Rollans, Holly Proudfoot, other guy
***** Jaques (teaching math142a)
***** ShiJin
***** XianFeng
***** Bo
***** Mat Langford
***** Julie
***** Ben
***** Steve Roberts
***** Janet Engebretsen
***** Friend and family
*** TODO Sync BBDB with google, phone etc.
** TODO check out "The brain"
[[http://www.thebrain.com/]]
  CLOCK: [2012-11-03 Sat 19:49]--[2012-11-03 Sat 19:49] =>  0:00
[2012-11-03 Sat 19:49]
** TODO Check out "The Brain"
[[http://www.thebrain.com/]]
  CLOCK: [2012-11-03 Sat 19:48]--[2012-11-03 Sat 19:48] =>  0:00
[2012-11-03 Sat 19:48]
** TODO Make list of all projects to VC
  CLOCK: [2012-11-06 Tue 08:33]--[2012-11-06 Tue 08:34] =>  0:01
[2012-11-06 Tue 08:33]

** SOMEDAY Manage Life

I want to direct my life better. This involves
 
- Setting goals
  - weekly
  - montly
  - yearly
  - 5 yearly
- collecting data 
  - what I've been doing
  - how long it took
  - how much it cost
  - how much I achieved etc
- Reviewing data
  - Look at graphs to see what I've been doing
  - re-evaluate tasks/goals in light of data
  - set new goals
  - plan tasks to meet goals

  CLOCK: [2012-11-06 Tue 14:58]--[2012-11-06 Tue 15:30] =>  0:32
[2012-11-06 Tue 14:58]
*** SOMEDAY Record habits
**** Tai Chi
**** Qi Qong
**** IntuFlow
**** Ageless Mobility
**** Primal Stress
**** Mediation
**** Convict conditioning
**** Chinese
**** Cooking
**** Books
**** Shows
**** Chess
*** SOMEDAY Set goals
Set long term goals and short term goals. Have say the weeks/months goals in org-mode and use these a guide to choosing tasks.
**** Health
***** Build physical strength
***** Build mental strength
***** Learn physical tricks
- handstand
- backflip
- planche
- tumbling
- wu shu
***** Sleep more
***** Eat naturally

**** Outdoors/sports
***** Bush walking
***** Soccer
***** Orienteering
***** Parkour

**** Gardening
***** Community gardening
***** Balcony gardening

**** Community
***** Online stuff like hacking
***** Health/Fitness
***** Quantified self
***** Maths
***** Family and friends
***** UCSD

**** Academic
***** Write papers
***** Write books
***** Teach

**** Hacking
***** emacs
***** android
***** computational
*** SOMEDAY Quantified self
**** Record how I use my time
I'll need to say use my phone to collect the data. I need something easy to clock in and out of an activity, like transit-shops, transit-uni, transit-home, house-cleaning, teaching-lecturing, teaching-preperation etc.

**** Record sleep
**** Record blood pressure?
**** Record weight
**** Record heart rate
**** Record finances such as groceries etc.

*** SOMEDAY Maintain references
I want to hang on to emails, articles and so on. I want to keep receipts, ideas and a diary of what I've done. These need to be kept in a filing system somehow, most probaby using org-mode and memacs.
** Reviews
Here I look at my goals, my tasks and how I've been spending my time and use that information to plan out the coming week/month/year etc.
**** Weekly
**** Monthly
**** 6 monthly?
**** yearly
**** 5 years?
** Schedule tasks
**** Set next tasks
**** Capture tasks as I think of them
**** Refile tasks a couple of times a day
**** Use property drawers to associate tasks with goal
* office layout
** NEXT get a cloth or coasters for office			     :ERRAND:
  CLOCK: [2012-10-15 Mon 09:36]--[2012-10-15 Mon 09:36] =>  0:00
   :PROPERTIES:
   :ID:       be6627ea-0e33-463b-91bf-cb7d140180cb
   :END:
[2012-10-15 Mon 09:36]
** NEXT Get snacks for office					     :ERRAND:
   SCHEDULED: <2012-12-01 Thu>
I should get a plunger and coffee to save money though milk is problematic then! I could bring it daily in a thermos.
I can bring in fruit and veg once or twice a week.
Also could have dry snacks, tinned stuff like sardines and so on.


  CLOCK: [2012-10-15 Mon 09:43]--[2012-10-15 Mon 09:44] =>  0:01
   :PROPERTIES:
   :ID:       eeb3b8ad-7b8e-4009-9273-e5bf24a717dc
   :END:
[2012-10-15 Mon 09:43]
** NEXT buy coffee plunger (french press)			     :ERRAND:
   SCHEDULED: <2012-12-01 Thu>
  CLOCK: [2012-10-16 Tue 10:48]--[2012-10-16 Tue 10:48] =>  0:00
   :PROPERTIES:
   :ID:       9f49adc3-355c-4ec4-bb31-458b3ab7d12b
   :END:
[2012-10-16 Tue 10:48]
** DONE Bring doorstop to work					       :HOME:
   - State "DONE"       from "NEXT"       [2012-11-10 Sat 13:46]
   :PROPERTIES:
   :ID:       27c8bddc-f9d4-48e6-b0ec-5de179e2822b
   :END:
** NEXT buy exercise ball and yoga mat for office		   :COMPUTER:
   SCHEDULED: <2012-12-01 Thu>
   :PROPERTIES:
   :ID:       01f23a0f-a1ec-47b6-87fe-81d301d4a144
   :END:
** DONE buy tablet cable for office				   :COMPUTER:
   SCHEDULED: <2012-11-01 Thu>
   - State "DONE"       from "NEXT"       [2012-11-03 Sat 14:04]
   :PROPERTIES:
   :ID:       856bc4e4-063d-4853-a492-45a6199249d5
   :END:
** DONE office sandals
   - State "DONE"       from "TODO"       [2012-10-24 Wed 14:47]
   :PROPERTIES:
   :ID:       ddd7d9ba-1677-4d4a-86b5-e5baf26d36a8
   :END:
** WAITING Get standing desk					     :OFFICE:
   - State "WAITING"    from "TODO"       [2012-10-18 Thu 14:25] \\
     Waiting for Maureen to find desk
  CLOCK: [2012-10-18 Thu 14:24]--[2012-10-18 Thu 14:25] =>  0:01
   :PROPERTIES:
   :ID:       3198eec6-d5f0-4ac3-b95c-ef2784843100
   :END:
[2012-10-18 Thu 14:24]

** TODO Setup priorities					   :COMPUTER:
*** NEXT Research org-mode priorities

* Computer setup
** NEXT Research Backups for android devices			   :COMPUTER:
What do I need to backup? I try to keep data in the cloud. I guess saved games and whatnot would be good to keep. Also there is some config, at least a list of apps!
  CLOCK: [2012-10-24 Wed 12:27]--[2012-10-24 Wed 12:27] =>  0:00
[2012-10-24 Wed 12:27]

** NEXT Pull everything but backups out of Ubuntu One		   :NOTEBOOK:
  CLOCK: [2012-10-24 Wed 12:17]--[2012-10-24 Wed 12:17] =>  0:00
[2012-10-24 Wed 12:17]
Copy the files to Dropbox instead
** NEXT Get notebook working files into dropbox			   :NOTEBOOK:
  CLOCK: [2012-10-24 Wed 12:18]--[2012-10-24 Wed 12:18] =>  0:00
[2012-10-24 Wed 12:18]

** TODO Work out some way to keep up to date with people's scripts
e.g. [[https://bitbucket.org/jaraco/jaraco.develop/src/819da4c3e702/jaraco/develop/bitbucket.py?at=default]]
  CLOCK: [2012-11-06 Tue 10:47]--[2012-11-06 Tue 10:48] =>  0:01
[2012-11-06 Tue 10:47]

** TODO Make email templates
e.g. seminar announcement
  CLOCK: [2012-11-09 Fri 10:38]--[2012-11-09 Fri 10:39] =>  0:01
[2012-11-09 Fri 10:38]


